12/data/attachments/876fec9fde0c8cd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_ccb6364d-4e0a-4708-8176-7131e5e87116</nif:username>
            <nif:friendToBeAdded>Michael_specific_Friend_42291_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>